benjaminjnoack/GREQ/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitOSCs
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitOSCs(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);

    /* PORTA18 (pin M12) is configured as EXTAL0 */
    PORT_SetPinMux(BOARD_EXTAL0_PORT, BOARD_EXTAL0_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTA19 (pin M11) is configured as XTAL0 */
    PORT_SetPinMux(BOARD_XTAL0_PORT, BOARD_XTAL0_PIN, kPORT_PinDisabledOrAnalog);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
MSGEQ7:
- options: {callFromInitBoot: 'true', prefix: MSGEQ7_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: A11, peripheral: GPIOC, signal: 'GPIO, 3', pin_signal: CMP1_IN1/PTC3/LLWU_P7/SPI0_PCS1/UART1_RX/FTM0_CH2/CLKOUT/I2S0_TX_BCLK, direction: OUTPUT}
  - {pin_num: A9, peripheral: GPIOC, signal: 'GPIO, 4', pin_signal: PTC4/LLWU_P8/SPI0_PCS0/UART1_TX/FTM0_CH3/FB_AD11/SDRAM_A19/CMP1_OUT, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: A12, peripheral: ADC0, signal: 'SE, 4b', pin_signal: ADC0_SE4b/CMP1_IN0/TSI0_CH15/PTC2/SPI0_PCS2/UART1_CTS_b/FTM0_CH1/FB_AD12/SDRAM_A20/I2S0_TX_FS}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : MSGEQ7
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void MSGEQ7(void)
{
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);

    gpio_pin_config_t Reset_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC3 (pin A11)  */
    GPIO_PinInit(MSGEQ7_Reset_GPIO, MSGEQ7_Reset_PIN, &Reset_config);

    gpio_pin_config_t Strobe_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTC4 (pin A9)  */
    GPIO_PinInit(MSGEQ7_Strobe_GPIO, MSGEQ7_Strobe_PIN, &Strobe_config);

    /* PORTC2 (pin A12) is configured as ADC0_SE4b */
    PORT_SetPinMux(MSGEQ7_Out_PORT, MSGEQ7_Out_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTC3 (pin A11) is configured as PTC3 */
    PORT_SetPinMux(MSGEQ7_Reset_PORT, MSGEQ7_Reset_PIN, kPORT_MuxAsGpio);

    /* PORTC4 (pin A9) is configured as PTC4 */
    PORT_SetPinMux(MSGEQ7_Strobe_PORT, MSGEQ7_Strobe_PIN, kPORT_MuxAsGpio);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
POTENTIOMETER:
- options: {callFromInitBoot: 'true', prefix: POTENTIOMETER_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: G10, peripheral: ADC1, signal: 'SE, 10', pin_signal: ADC1_SE10/PTB4/ENET0_1588_TMR2/SDRAM_CS1_b/FTM1_FLT0}
  - {pin_num: G9, peripheral: ADC1, signal: 'SE, 11', pin_signal: ADC1_SE11/PTB5/ENET0_1588_TMR3/FTM2_FLT0}
  - {pin_num: F12, peripheral: ADC1, signal: 'SE, 12', pin_signal: ADC1_SE12/PTB6/FB_AD23/SDRAM_D23}
  - {pin_num: F11, peripheral: ADC1, signal: 'SE, 13', pin_signal: ADC1_SE13/PTB7/FB_AD22/SDRAM_D22}
  - {pin_num: K3, peripheral: ADC1, signal: 'SE, 16', pin_signal: ADC1_SE16/CMP2_IN2/ADC0_SE22}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : POTENTIOMETER
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void POTENTIOMETER(void)
{
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);

    /* PORTB4 (pin G10) is configured as ADC1_SE10 */
    PORT_SetPinMux(POTENTIOMETER_ADC1_SE10_PORT, POTENTIOMETER_ADC1_SE10_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB5 (pin G9) is configured as ADC1_SE11 */
    PORT_SetPinMux(POTENTIOMETER_ADC1_SE11_PORT, POTENTIOMETER_ADC1_SE11_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB6 (pin F12) is configured as ADC1_SE12 */
    PORT_SetPinMux(POTENTIOMETER_ADC1_SE12_PORT, POTENTIOMETER_ADC1_SE12_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB7 (pin F11) is configured as ADC1_SE13 */
    PORT_SetPinMux(POTENTIOMETER_ADC1_SE13_PORT, POTENTIOMETER_ADC1_SE13_PIN, kPORT_PinDisabledOrAnalog);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
ROTARY_ENCODER:
- options: {callFromInitBoot: 'true', prefix: ROTARY_ENCODER_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: A5, peripheral: GPIOD, signal: 'GPIO, 0', pin_signal: PTD0/LLWU_P12/SPI0_PCS0/UART2_RTS_b/FTM3_CH0/FB_ALE/FB_CS1_b/FB_TS_b, direction: INPUT, gpio_interrupt: kPORT_InterruptEitherEdge}
  - {pin_num: D12, peripheral: GPIOB, signal: 'GPIO, 18', pin_signal: TSI0_CH11/PTB18/CAN0_TX/FTM2_CH0/I2S0_TX_BCLK/FB_AD15/SDRAM_A23/FTM2_QD_PHA/TPM2_CH0, direction: INPUT,
    gpio_interrupt: kPORT_InterruptRisingEdge, pull_select: up, pull_enable: disable}
  - {pin_num: D11, peripheral: GPIOB, signal: 'GPIO, 19', pin_signal: TSI0_CH12/PTB19/CAN0_RX/FTM2_CH1/I2S0_TX_FS/FB_OE_b/FTM2_QD_PHB/TPM2_CH1, direction: INPUT,
    gpio_interrupt: kPORT_InterruptRisingEdge, pull_select: up, pull_enable: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : ROTARY_ENCODER
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void ROTARY_ENCODER(void)
{
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);

    gpio_pin_config_t PHASE_A_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB18 (pin D12)  */
    GPIO_PinInit(ROTARY_ENCODER_PHASE_A_GPIO, ROTARY_ENCODER_PHASE_A_PIN, &PHASE_A_config);

    gpio_pin_config_t PHASE_B_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB19 (pin D11)  */
    GPIO_PinInit(ROTARY_ENCODER_PHASE_B_GPIO, ROTARY_ENCODER_PHASE_B_PIN, &PHASE_B_config);

    gpio_pin_config_t BUTTON_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD0 (pin A5)  */
    GPIO_PinInit(ROTARY_ENCODER_BUTTON_GPIO, ROTARY_ENCODER_BUTTON_PIN, &BUTTON_config);

