benjaminjnoack/GREQ/board/pin_mux.c
    /* PORTB18 (pin D12) is configured as PTB18 */
    PORT_SetPinMux(ROTARY_ENCODER_PHASE_A_PORT, ROTARY_ENCODER_PHASE_A_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTB18 (pin D12): Interrupt on rising edge */
    PORT_SetPinInterruptConfig(ROTARY_ENCODER_PHASE_A_PORT, ROTARY_ENCODER_PHASE_A_PIN, kPORT_InterruptRisingEdge);

    PORTB->PCR[18] = ((PORTB->PCR[18] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | PORT_PCR_PS(kPORT_PullUp)

                      /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding
                       * pin. */
                      | PORT_PCR_PE(kPORT_PullDisable));

    /* PORTB19 (pin D11) is configured as PTB19 */
    PORT_SetPinMux(ROTARY_ENCODER_PHASE_B_PORT, ROTARY_ENCODER_PHASE_B_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTB19 (pin D11): Interrupt on rising edge */
    PORT_SetPinInterruptConfig(ROTARY_ENCODER_PHASE_B_PORT, ROTARY_ENCODER_PHASE_B_PIN, kPORT_InterruptRisingEdge);

    PORTB->PCR[19] = ((PORTB->PCR[19] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | PORT_PCR_PS(kPORT_PullUp)

                      /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding
                       * pin. */
                      | PORT_PCR_PE(kPORT_PullDisable));

    /* PORTD0 (pin A5) is configured as PTD0 */
    PORT_SetPinMux(ROTARY_ENCODER_BUTTON_PORT, ROTARY_ENCODER_BUTTON_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTD0 (pin A5): Interrupt on either edge */
    PORT_SetPinInterruptConfig(ROTARY_ENCODER_BUTTON_PORT, ROTARY_ENCODER_BUTTON_PIN, kPORT_InterruptEitherEdge);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
MAX7219:
- options: {callFromInitBoot: 'true', prefix: MAX7219_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: A3, peripheral: SPI1, signal: SCK, pin_signal: ADC0_SE6b/PTD5/SPI0_PCS2/UART0_CTS_b/UART0_COL_b/FTM0_CH5/FB_AD1/SDRAM_A9/EWM_OUT_b/SPI1_SCK, direction: OUTPUT}
  - {pin_num: A2, peripheral: SPI1, signal: SOUT, pin_signal: ADC0_SE7b/PTD6/LLWU_P15/SPI0_PCS3/UART0_RX/FTM0_CH6/FB_AD0/FTM0_FLT0/SPI1_SOUT}
  - {pin_num: A1, peripheral: SPI1, signal: SIN, pin_signal: PTD7/CMT_IRO/UART0_TX/FTM0_CH7/SDRAM_CKE/FTM0_FLT1/SPI1_SIN}
  - {pin_num: A4, peripheral: SPI1, signal: PCS0_SS, pin_signal: PTD4/LLWU_P14/SPI0_PCS1/UART0_RTS_b/FTM0_CH4/FB_AD2/SDRAM_A10/EWM_IN/SPI1_PCS0, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : MAX7219
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void MAX7219(void)
{
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);

    /* PORTD4 (pin A4) is configured as SPI1_PCS0 */
    PORT_SetPinMux(MAX7219_PCS_PORT, MAX7219_PCS_PIN, kPORT_MuxAlt7);

    /* PORTD5 (pin A3) is configured as SPI1_SCK */
    PORT_SetPinMux(MAX7219_SCK_PORT, MAX7219_SCK_PIN, kPORT_MuxAlt7);

    /* PORTD6 (pin A2) is configured as SPI1_SOUT */
    PORT_SetPinMux(MAX7219_SOUT_PORT, MAX7219_SOUT_PIN, kPORT_MuxAlt7);

    /* PORTD7 (pin A1) is configured as SPI1_SIN */
    PORT_SetPinMux(MAX7219_SIN_PORT, MAX7219_SIN_PIN, kPORT_MuxAlt7);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
GP:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: C4, peripheral: GPIOD, signal: 'GPIO, 2', pin_signal: PTD2/LLWU_P13/SPI0_SOUT/UART2_RX/FTM3_CH2/FB_AD4/SDRAM_A12/I2C0_SCL, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : GP
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void GP(void)
{
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);

    gpio_pin_config_t DEBUG_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD2 (pin C4)  */
    GPIO_PinInit(GP_DEBUG_GPIO, GP_DEBUG_PIN, &DEBUG_config);

    /* PORTD2 (pin C4) is configured as PTD2 */
    PORT_SetPinMux(GP_DEBUG_PORT, GP_DEBUG_PIN, kPORT_MuxAsGpio);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
